# vsoWidgetGetEnable

## Description
```pascal
FUNCTION vsoWidgetGetEnable(widgetID : LONGINT) : BOOLEAN;
```

```python

def vs.vsoWidgetGetEnable(widgetID):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|widgetID|LONGINT||

## Version
Availability: from Vectorworks 2011
## Category
* Object Events